# Напишете програма, която пресмята колко общо пари има в сметката, след като направите определен брой вноски. На всеки ред ще получавате сумата, която трябва да внесете
# в сметката, до получаване на команда  "NoMoreMoney ". При всяка получена сума на конзолата трябва да се извежда "Increase: " + сумата и тя да се прибавя в сметката.
# Ако получите число по-малко от 0 на конзолата трябва да се изведе "Invalid operation!"  и програмата да приключи. Когато програмата приключи трябва да се принтира
# "Total: " + общата сума в сметката форматирана до втория знак след десетичната запетая.
avi_sum = 0

while True:
    cur_sum = input()
    if cur_sum == "NoMoreMoney":
        break
    cur_sum = float(cur_sum)
    if cur_sum >= 0:
        avi_sum += cur_sum
        print(f'Increase: {cur_sum:.2f}')
    else:
        print('Invalid operation!')
        break
print(f'Total: {avi_sum:.2f}')
